---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.PowerLoadUnit
source: html/d27a98bf-a5a9-0aca-3d02-729708a2d7d2.htm
---
# Autodesk.Revit.DB.Mechanical.Space.PowerLoadUnit Property

Get or set the Power Load Unit of the Space.

## Syntax (C#)
```csharp
public BaseLoadOn PowerLoadUnit { get; set; }
```

## Remarks
This property is used to get or set the Power Load Unit of the Space.